In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [10]:
netflix_titles_csv = "Resources/netflix_titles_transformed.csv"
titles = pd.read_csv(netflix_titles_csv)
titles.head()

,type,title,director,country,release_year
0,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","United States, India, South Korea, China",2019
1,Movie,Jandino: Whatever it Takes,NaN,United Kingdom,2016
2,TV Show,Transformers Prime,NaN,United States,2013
3,TV Show,Transformers: Robots in Disguise,NaN,United States,2016
4,Movie,#realityhigh,Fernando Lebrija,United States,2017

In [11]:
credits_csv = "Resources/movie_writers_df.csv"
credits = pd.read_csv(credits_csv)
credits.head()

   movie_id          writer
0       862     Joss Whedon
1       862  Andrew Stanton
2       862      Joel Cohen
3       862    Alec Sokolow
4       862   John Lasseter

In [12]:
metadata_csv = "Resources/movie_metadata_transformed.csv"
metadata = pd.read_csv(metadata_csv)
metadata.head()

,budget,revenue,id,original_title,title
0,30000000,373554033.0,862,Toy Story,Toy Story
1,65000000,262797249.0,8844,Jumanji,Jumanji
2,0,0.0,15602,Grumpier Old Men,Grumpier Old Men
3,16000000,81452156.0,31357,Waiting to Exhale,Waiting to Exhale
4,0,76578911.0,11862,Father of the Bride Part II,Father of the Bride Part II

In [13]:
connection_string = "postgres:postgres@localhost:5432/ETL_project"
engine = create_engine(f'postgresql://{connection_string}')

In [14]:
engine.table_names()

['metadata', 'titles', 'credits']

In [15]:
metadata.to_sql(name='metadata', con=engine, if_exists='append', index=False)

In [16]:
titles.to_sql(name='titles', con=engine, if_exists='append', index=False)

In [17]:
credits.to_sql(name='credits', con=engine, if_exists='append', index=False)